Repository: Cielquan/RUlaub
Catalog: src/locales/*/messages.po
Languages: de_de

source: Error: Failed to write to config file.
de_de: Error: Schreiben in die Config Datei fehlgeschlagen.

source: Warning: Config could not be saved.
de_de: Warnung: Config konnte nicht gespeichert werden.

source: Error: Could not serialize config.
de_de: Error: Serialisieren der Config fehlgeschlagen.

source: Error: Failed to connect to database.
de_de: Error: Datenbank Verbindung fehlgeschlagen.

source: Error: Failed to create new database.
de_de: Error: Erstellen neuer Datenbank fehlgeschlagen.

source: Error: Failed to delete entry in database.
de_de: Error: Löschen des Datenbank Eintrags fehlgeschlagen.

source: Error: Unknown error with the database.
de_de: Error: Unbekannter Fehler mit der Datenbank.

source: Error: Failed to insert new entry in database.
de_de: Error: Hinzufügen eines neuen Datanbank Eintrags fehlgeschlagen.

source: Error: Got invalid data for database update.
de_de: Error: Ungültige Daten für Datenbank update erhalten.

source: Error: Failed to load entry in database.
de_de: Error: Laden eines Datenbank Eintrags fehlgeschlagen.

source: Error: No database set.
de_de: Error: Keine Datenbank ausgewählt.

source: Error: Failed to update entry in database.
de_de: Error: Update eines Datenbank Eintrags fehlgeschlagen.

source: Error: Failed to load data from school holiday link into JSON schema.
de_de: Error: Laden der Daten vom Schulferienlink ins JSON Schema fehlgeschlagen.

source: Error: No "year to show" selected.
de_de: Error: Kein "Jahr zum Anzeigen" ausgewählt.

source: Error: No school holidays link is set.
de_de: Error: Kein Schulferienlink gesetzt.

source: Error: Got non ok response from school holiday link.
de_de: Error: Schulferienlink gab eine nicht-ok Antwort.

source: Error: Got to many links from the database.
de_de: Error: Zu viele Links von der Datenbank erhalten.

source: Error: Failed to request data from school holiday link.
de_de: Error: Datenanfrage vom Schulferienlink fehlgeschlagen.

source: Error: Some unknown error happend. Please the the logs for more information.
de_de: Error: Ein unbekannter Fehler ist aufgetreten. In den Logs stehen weitere Informationen.

source: Failed to create config file. Changes to config cannot be saved. Falling back to default config.
de_de: Fehler beim Erstellen der Config Datei. Änderungen können nicht gespeichert werden. Standard Config wird verwendet.

source: Failed to read from config file. Falling back to default config.
de_de: Fehler beim Lesen der Config Datei. Standard Config wird verwendet.

source: No config file found. Falling back to default config.
de_de: Keine Config Datei gefunden. Standard Config wird verwendet.

source: No database file found. Please select or create a new database file via the sidemenu.
de_de: Keine Datenbankdatei gefunden. Bitte eine neue Datenbank über das Seitenmenu auswählen oder erstellen.

source: Failed to connect to or update the database. Please check the database file and restart the programm.
de_de: Update oder Verbindung zu der Datenbank fehlgeschlagen. Bitte die Datenbankdatei prüfen und das Programm neu starten.

source: RUlaub is licensed under either 'Apache License 2.0' or 'MIT License' at your option.
de_de: RUlaub ist frei wählbar unter der 'Apache License 2.0' oder 'MIT License' lizensiert.

source: For the Source Code, Documentation and copies of the License files please see the github repository at: {ghLink}.
de_de: Quellcode, Dokumentation und Kopien der Lizenzen sind im Github Repository zu finden: {ghLink}.

source: Close
de_de: Schließen

source: Vacation must have a type.
de_de: Urlaub muss einen Typ haben.

source: A start date must be selected.
de_de: Ein Startdatum muss aufgewählt werden.

source: Start date cannot be bigger than end date.
de_de: Startdatum kann nicht größer als das Enddatum sein.

source: An end date must be selected.
de_de: Ein Enddatum muss aufgewählt werden.

source: End date cannot be smaller than start date.
de_de: Enddatum kann nicht kleiner als das Startdatum sein.

source: Add Vacation
de_de: Urlaub hinzufügen

source: Please select the user to add a vacation to.
de_de: Bitte einen Nutzer auswählen, um Urlaub einzutragen.

source: User
de_de: Benutzer

source: Type
de_de: Typ

source: Start Date
de_de: Startdatum

source: End Date
de_de: Enddatum

source: Save
de_de: Speichern

source: Discard
de_de: Verwerfen

source: Edit Users
de_de: Nutzer bearbeiten

source: No year to show selected. Please select one below:
de_de: Kein Jahr zum Anzeigen ausgewählt. Bitte unten auswählen:

source: Change displayed year.
de_de: Angezeigtes Jahr ändern.

source: Create new Database
de_de: Neue Datenbank erstellen

source: Database file path
de_de: Datenbank Dateipfad

source: Add default values for Germany NRW to database.
de_de: Default Werte für Deutschland NRW in Datenbank einpflegen

source: Create
de_de: Erstellen

source: Abort
de_de: Abbrechen

source: Activate Light Theme
de_de: Helles Design aktivieren

source: Activate Dark Theme
de_de: Dunkles Design aktivieren

source: Download school holidays?
de_de: Schulferien downloaden?

source: No school holiday data found in the database. Do you want to download school holiday data from the set link?
de_de: Keine Schulferien-Daten in der Datenbank gefunden. Möchtest du Schulferien von dem eingestellten Link downloaden?

source: Yes
de_de: Ja

source: No
de_de: Nein

source: Load current year data
de_de: Daten für aktuelles Jahr laden

source: Load all data
de_de: Alle Daten laden

source: Add new Holiday
de_de: Neuen Urlaub hinzufügen

source: Public Holidays
de_de: Feiertage

source: Save changes to database
de_de: Änderungen in Datenbank speichern

source: Public Holiday must have a name.
de_de: Feiertag muss eine Bezeichnung haben.

source: Only positive whole numbers are permitted.
de_de: Nur positive ganze Zahlen sind zulässig.

source: A date must be entered.
de_de: Ein Datum muss eingegeben werden.

source: Invalid Format. Please use format: Month-Day e.g. 01-31
de_de: Ungültiges Format. Bitte benutze das Format: Monat-Tag z.B. 01-31

source: Invalid Date. Please enter date in format: Month-Day e.g. 01-31
de_de: Ungültiges Datum. Bitte Datum eingeben im Format: Monat-Tag z.B. 01-31

source: An offset must be entered.
de_de: Ein Offset muss eingegeben werden.

source: Month-Day
de_de: Monat-Tag

source: Easter Sunday Offset
de_de: Ostersonntag Offset

source: Every
de_de: Jedes

source: Year
de_de: Jahr

source: Date
de_de: Datum

source: Cancel
de_de: Abbrechen

source: Cancel deletion of entry
de_de: Löschung des Eintrags abbrechen

source: Delete entry
de_de: Eintrag löschen

source: Save entry
de_de: Eintrag speichern

source: Edit entry
de_de: Eintrag ändern

source: The link must start with "https://".
de_de: Der Link muss mit "https://" starten.

source: The link must have a "'%year%'" placeholder.
de_de: Der Link muss einen "'%year%'" Platzhalter beinhalten.

source: School Holidays
de_de: Ferien

source: School Holiday must have a name.
de_de: Ferien muss eine Bezeichnung haben.

source: Load School Holidays for year: {0}
de_de: Download Schulferien für das Jahr: {0}

source: Scroll to today
de_de: Nach Heute scrollen

source: Settings
de_de: Einstellungen

source: Enter your name to have it be preselected when entering new vacation.
de_de: Gebe deinen Namen ein, damit dieser bei Urlaubseinträgen vorausgewählt werden kann.

source: Advanced Settings
de_de: Erweiterte Einstellungen

source: On year switch, scroll to beginning of the year.
de_de: Scoll zum Jahrsstart beim Jahreswechsel.

source: Database
de_de: Datenbank

source: Select
de_de: Auswählen

source: Users
de_de: Benutzer

source: Edit
de_de: Bearbeiten

source: Vacation Types
de_de: Urlaubsarten

source: Vacation
de_de: Urlaub

source: About
de_de: Über

source: <Set Username>
de_de: <Nutzername festlegen>

source: User must have a name.
de_de: Nutzer muss einen Namen haben.

source: User must a number of Vacation days.
de_de: Nutzer muss eine Anzahl an Urlaubstagen haben.

source: At least one workday must be selected.
de_de: Mindestens ein Arbeitstag muss ausgewählt werden.

source: Vacation Days
de_de: Urlaubstage

source: Workdays
de_de: Arbeitstage

source: Vacation Type must have a name.
de_de: Urlaubsart muss eine Bezeichnung haben.

source: Charge to annual leave
de_de: Anrechnung auf den Jahresurlaub

source: Color (Dark theme)
de_de: Farbe (Dunkles Design)

source: Color (Light theme)
de_de: Farbe (Helles Design)

source: Activate
de_de: Aktivieren

source: Deactivate
de_de: Deaktivieren

source: Vacations
de_de: Urlaube

source: Please select a user to show their vacations.
de_de: Bitte Benutzer wählen, um Urlaube anzuzeigen.

source: No data for user: {0}
de_de: Keine Daten für Nutzer: {0}

source: Error
de_de: Fehler

source: {0, plural, one {Got one error while loading public holiday data.} other {Got # errors while loading public holiday data.}}
de_de: {0, plural, one {Wärend des Ladens der Feiertage trat ein Fehler auf.} other {Wärend des Ladens der Feiertage traten # Fehler auf.}}

source: {errorCount, plural, one {Got one error from downloaded school holiday data.} other {Got # errors from downloaded school holiday data.}}
de_de: {errorCount, plural, one {Wärend des Runterladens der Schulferien trat ein Fehler auf.} other {Wärend des Runterladens der Schulferien traten # Fehler auf.}}

source: {inDbCount, plural, one {One downloaded school holiday data set is already in the database.} other {# downloaded school holiday data sets are already in the database.}}
de_de: {inDbCount, plural, one {Ein runtergeladener Schulferien-Datensatz ist bereits in der Datenbank.} other {# runtergeladene Schulferien-Datensätze sind bereits in der Datenbank.}}

source: {doubleCount, plural, one {Got one double data set from downloaded school holiday data.} other {Got # double data sets from downloaded school holiday data.}}
de_de: {doubleCount, plural, one {Die runtergeladenen Schulferien enthielten einen doppelten Datensatz.} other {Die runtergeladenen Schulferien enthielten # doppelte Datensätze.}}

source: Successfully downloaded school holidays for year: {year}
de_de: Download von Schulferien für das Jahr {year} war erfolgreich.

source: {pubHolidayErrorCount, plural, one {Got one error while loading public holiday data for vacation stats.} other {Got # errors while loading public holiday data for vacation stats.}}
de_de: {pubHolidayErrorCount, plural, one {Wärend des Ladens der Feiertage für die Urlaubsstatistik trat ein Fehler auf.} other {Wärend des Ladens der Feiertage für die Urlaubsstatistik traten # Fehler auf.}}

source: {vacationErrorCount, plural, one {Got one error while loading vacation data for vacation stats.} other {Got # errors while loading vacation data for vacation stats.}}
de_de: {vacationErrorCount, plural, one {Wärend des Ladens der Urlaube für die Urlaubsstatistik trat ein Fehler auf.} other {Wärend des Ladens der Urlaube für die Urlaubsstatistik traten # Fehler auf.}}

source: January
de_de: Januar

source: February
de_de: Februar

source: March
de_de: März

source: May
de_de: Mai

source: June
de_de: Juni

source: July
de_de: Juli

source: October
de_de: Oktober

source: December
de_de: Dezember

source: Monday
de_de: Montag

source: Tuesday
de_de: Dienstag

source: Wednesday
de_de: Mittwoch

source: Thursday
de_de: Donnerstag

source: Friday
de_de: Freitag

source: Saturday
de_de: Samstag

source: Sunday
de_de: Sonntag
